"""
    Напишите функцию, которая принимает словарь,
    меняет местами ключи и значения и возвращает его.

    Покройте функцию несколькими тестами.

    Пример:
    a = {'key': 'value', 'd': 1234}
    b = swap_items(a)
    print(b)
    {'value': 'key', 1234: 'd'}

    * пропускайте пары, в которых значение не может быть ключем

    ** ключем словаря может быть только не изменяемый объект,
        а точнее тот, который можно захешировать функцией hash()

"""
